{
  "url": "https://example.com/gulka-atwell-peak",
  "clean_text": "---\ntitle: Donate to Remembering Chris Gulka and Jon Büchner, organized by Lukas Mann\nauthor: Lukas Mann is organizing this fundraiser\nurl: https://www.gofundme.com/f/remembering-chris-gulka-and-jon-buchner?lang=en_US\nhostname: gofundme.com\ndescription: Fund purpose: Celebration of Life and support for Squamish SAR On May 31st, the… Lukas Mann needs your support for Remembering Chris Gulka and Jon Büchner\nsitename: gofundme.com\ndate: 2024-07-17\n---\nRemembering Chris Gulka and Jon Büchner\nDonation protected\nFund purpose: Celebration of Life and support for Squamish SAR\nOn May 31st, the world lost three wonderful young men on Atwell Peak, near Squamish, British Columbia. Two of the climbers, Jonathan Buchner and Chris Gulka, were locals from Langley, BC. The trio reached the summit that morning, but were caught in a catastrophic avalanche on their descent. A lengthy search concluded with a recovery on July 8th, over 5 weeks after their disappearance.\nOur community is devastated by this loss. These young men embodied the spirit of adventure, resilience, and camaraderie that defines the mountain community in the lower mainland of BC. They were not just climbers... their love of life and warm hearts touched many lives, both within the climbing & outdoor communities as well as in their work & personal lives.\nIn their honour, we have organized a Celebration of Life event for Chris and Jon on August 18, from 1:30-5:30pm in Chilliwack.\nThis event will provide a space for friends, family, fellow adventurers and others who knew the boys to come together to remember and celebrate the lives of Jon and Chris. This will be a time to share stories, offer support, and pay tribute to their remarkable spirits, amazing adventures and outstanding characters.\nRSVP at the link above if you are willing and able to attend.\nPurpose of the Fund\nWe are reaching out for support in funding the celebration of life for Chris & Jon. Costs will be kept to a minimum, with 100% of excess funds donated to Squamish Search and Rescue (SSAR) for their exceptional service and support over the course of the search and recovery period.\nOur total goal is to raise $10,000 with a minimum of $5,000 going directly to SSAR.\nHow You Can Help\nYour contribution, no matter the size, will make a difference. If you are unable to contribute financially, sharing this campaign with others is immensely valuable and appreciated.\nThank You\nWe are deeply grateful for your support during this difficult time. Your generosity and kindness will not only honour these special young men but will also show gratitude to Squamish Search and Rescue for the heroic work they do, benefitting not only our families but countless others over their years of service.\n*note: this is a community event, the families of Jon and Chris will be holding funerals at a later date.\nSincerely, the families & friends of Jon Buchner and Chris Gulka\nOrganizer\nLukas Mann\nOrganizer\nLangley, BC\n",
  "publisher": "GoFundMe",
  "article_title": "Donate to Remembering Chris Gulka and Jon Büchner, organized by Lukas Mann",
  "date_published": "2024-07-17"
}
